АлогистикТест2/src/Documents/алк_ВводПроизводственныхПоказателейДГ/алк_ВводПроизводственныхПоказателейДГ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_ВводПроизводственныхПоказателейДГ</name>
  <registerRecords>AccumulationRegister.алк_ОборотыПроизводства</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СменаУдалить</name>
    <type>
      <types>EnumRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Направление</name>
    <type>
      <types>EnumRef.алк_НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОперативныеПоказателиПроизводства</name>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.алк_ПоказателиПроизводстваДГ</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПоказателиОперсводки</name>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.алк_ПоказателиПроизводства</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/InformationRegisters/алк_ПлановыеПоказатели/алк_ПлановыеПоказатели.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>алк_ПлановыеПоказатели</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Значение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗначениеГодовое</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ПроизводственныйПоказатель</name>
    <type>
      <types>CatalogRef.алк_ПоказателиПроизводства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СменаУдалить</name>
    <type>
      <types>EnumRef.Смены</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

АлогистикТест2/src/Documents/алк_РасформированиеПакетов/алк_РасформированиеПакетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_РасформированиеПакетов</name>
  <basedOn>Document.алк_ПеремещениеЗапасов</basedOn>
  <registerRecords>AccumulationRegister.алк_ЗапасыОрганизацииСерии</registerRecords>
  <registerRecords>AccumulationRegister.алк_ДокументыПоследовательностиПродукция</registerRecords>
  <registerRecords>AccumulationRegister.алк_ЗапасыОрганизации</registerRecords>
  <registerRecords>AccumulationRegister.алк_ЗапасыНаСкладахСерии</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОстаткиЗапасов</registerRecords>
  <registerRecords>AccumulationRegister.алк_ПроизводствоОборот</registerRecords>
  <registerRecords>InformationRegister.СерийныеНомераГарантии</registerRecords>
  <registerRecords>InformationRegister.алк_ПараметрыПакетов</registerRecords>
  <attributes>
    <name>Направление</name>
    <type>
      <types>EnumRef.алк_НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СменаУдалить</name>
    <type>
      <types>EnumRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Ячейка</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.алк_ПеремещениеЗапасов</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>переупаковка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Запасы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>CatalogRef.СерийныеНомера</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПакетов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/Catalogs/алк_ПоказателиПроизводства/алк_ПоказателиПроизводства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>алк_ПоказателиПроизводства</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Направление</name>
    <type>
      <types>EnumRef.алк_НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>алк_ОперацияПроизводства</name>
    <type>
      <types>EnumRef.алк_ОперацииПроизводства</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьНоменклатура</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьПорода</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьВидОтгрузки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьОтветхранение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьНесортированная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьВлажность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьСклад</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьСушильныеКамеры</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьСорт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьОрганизация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьХарактеристика</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>СкрытьЗначенияВОтчете</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыделитьЦветомВОтчете</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокВОтчете</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВводитсяАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИтогиПоСреднему</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Сорта</name>
    <attributes>
      <name>Сорт</name>
      <type>
        <types>CatalogRef.Сорта</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Породы</name>
    <attributes>
      <name>Порода</name>
      <type>
        <types>CatalogRef.Породы</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Номенклатуры</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Влажности</name>
    <attributes>
      <name>Влажность</name>
      <type>
        <types>CatalogRef.Влажность</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВидыОтгрузки</name>
    <attributes>
      <name>ВидОтгрузки</name>
      <type>
        <types>EnumRef.алк_ВидыОтгрузки</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Склады</name>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.СтруктурныеЕдиницы</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Организации</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Характеристики</name>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

АлогистикТест2/src/Documents/алк_ВводПроизводственныхПоказателейДГ/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура Шаблон(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ПослеВводаЗначения", ЭтотОбъект);	
	
	ПоказатьВводЗначения(Оповещение, , "Введите номер шаблона", "Число");	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаЗначения(Результат, Параметры) Экспорт	
 
	Если Не Результат = Неопределено Тогда
		
		Шаблон1НаСервере("Шаблон" + Результат);
		ЭтаФорма.ОбновитьОтображениеДанных();
		Модифицированность = Истина;			
		
	КонецЕсли;
 
КонецПроцедуры

&НаСервере
Процедура Шаблон1НаСервере(Шаблон)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ВводПроизводственныхПоказателейДГ.Ссылка как Документ
		|ИЗ
		|	Документ.алк_ВводПроизводственныхПоказателейДГ КАК алк_ВводПроизводственныхПоказателейДГ
		|ГДЕ
		|	алк_ВводПроизводственныхПоказателейДГ.Комментарий ПОДОБНО &Комментарий
		|	И НЕ алк_ВводПроизводственныхПоказателейДГ.Ссылка.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Комментарий", Шаблон);
		
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	
	Если Не ВыборкаДетальныеЗаписи.Следующий() Тогда  		
		Возврат;
	КонецЕсли;
	
	ЗагрузкаББшт 	= Справочники.алк_ПоказателиПроизводстваДГ.НайтиПоКоду("000000006"); //Загрузка б/б, шт
	ЗагрузкаББт 	= Справочники.алк_ПоказателиПроизводстваДГ.НайтиПоКоду("000000024"); //Загрузка б/б, т
	
	ЗагрузкаББштФакт 	= 0;
	ЗагрузкаББтФакт 	= 0;
	
	Объект.ОперативныеПоказателиПроизводства.Очистить();
	Объект.ПоказателиОперсводки.Очистить();
	
	Для каждого Строка из ВыборкаДетальныеЗаписи.Документ.ОперативныеПоказателиПроизводства Цикл
		НоваяСтр = Объект.ОперативныеПоказателиПроизводства.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтр, Строка);
	КонецЦикла;
	
	// получаем данные по упаковке 	

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_СборкаЗапасовПродукция.НомерСтроки,
		|	алк_СборкаЗапасовПродукция.Номенклатура,
		|	алк_СборкаЗапасовПродукция.Характеристика,
		|	алк_СборкаЗапасовПродукция.Количество КАК Количество,
		|	1 КАК КоличествоПакетов
		|ИЗ
		|	Документ.алк_СборкаЗапасов.Продукция КАК алк_СборкаЗапасовПродукция
		|ГДЕ
		|	алк_СборкаЗапасовПродукция.Ссылка.ДатаСмены = &ДатаСмены
		|	И алк_СборкаЗапасовПродукция.Ссылка.Смена = &Смена
		|	И алк_СборкаЗапасовПродукция.Ссылка.Проведен
		|	И алк_СборкаЗапасовПродукция.Ссылка.Направление = &Направление
		|ИТОГИ
		|	СУММА(Количество),
		|	СУММА(КоличествоПакетов)
		|ПО
		|	ОБЩИЕ";
	
	Запрос.УстановитьПараметр("ДатаСмены", Объект.ДатаСмены);
	Запрос.УстановитьПараметр("Направление", Объект.Направление);
	Запрос.УстановитьПараметр("Смена", Объект.Смена);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока Выборка.Следующий() Цикл  		
		ЗагрузкаББштФакт 	= Выборка.КоличествоПакетов;
		ЗагрузкаББтФакт 	= Выборка.Количество;  		
	КонецЦикла;
	
	// подстановка данных упаковки
	
	Для каждого Строка из Объект.ОперативныеПоказателиПроизводства Цикл
		
		Если Строка.Показатель = ЗагрузкаББшт Тогда			
			Строка.Значение =ЗагрузкаББштФакт;  		
		КонецЕсли;
		
		Если Строка.Показатель = ЗагрузкаББт Тогда			
			Строка.Значение =ЗагрузкаББтФакт/1000;  		
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	Если не ЗначениеЗаполнено(ТекущийОбъект.Ответственный) тогда
		ТекущийОбъект.Ответственный =  Пользователи.ТекущийПользователь();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоказателиОперсводкиНаСервере()
	
	// показатели производства  
	
	ПроцентКоры = Справочники.алк_ПоказателиПроизводстваДГ.НайтиПоКоду("000000029"); //Процент коры

	ПотреблениеНаКотельную = Справочники.алк_ПоказателиПроизводстваДГ.НайтиПоКоду("000000026"); //Потребление сырья на котельную (сутки/2, м.куб.)
		
	Пресс1 = Справочники.алк_ПоказателиПроизводстваДГ.НайтиПоКоду("000000011");  //Пресс№1, Мот/час
	Пресс2 = Справочники.алк_ПоказателиПроизводстваДГ.НайтиПоКоду("000000013");  //Пресс№2, Мот/час 
	Пресс3 = Справочники.алк_ПоказателиПроизводстваДГ.НайтиПоКоду("000000015");  //Пресс№3, Мот/час
	
	ПроизводствоПеллет = Справочники.алк_ПоказателиПроизводстваДГ.НайтиПоКоду("000000003");  //Производство пеллет, тн.
	
	УпакованоПеллет = Справочники.алк_ПоказателиПроизводстваДГ.НайтиПоКоду("000000024");  //Упаковано пеллет, тн.
		
	КРС = Справочники.алк_ПоказателиПроизводстваДГ.НайтиПоКоду("000000027"); //КРС на производство пеллет
	
	ОстаткиВСилосе = Справочники.алк_ПоказателиПроизводстваДГ.НайтиПоКоду("000000028"); //Остатки в силосе, % 
	
	ПолученоПослеДробилки_ДГ = Справочники.алк_ПоказателиПроизводстваДГ.НайтиПоКоду("000000033"); // Получено сырья после дробления
	
	ПолученоПослеДробленияМРБ110_ДГ = Справочники.алк_ПоказателиПроизводстваДГ.НайтиПоКоду("000000034"); // Получено после дробления МРБ-110
	
	ПолученоПослеДробленияМРБ250_ДГ = Справочники.алк_ПоказателиПроизводстваДГ.НайтиПоКоду("000000036"); // Получено после дробления МРБ-250
	
	ПолученоПослеДробленияМЛП_2_ДГ = Справочники.алк_ПоказателиПроизводстваДГ.НайтиПоКоду("000000037"); // Получено после дробления  МЛП№2 (в марте)
	
	ПолученоПослеДробленияCKS1000_ДГ = Справочники.алк_ПоказателиПроизводстваДГ.НайтиПоКоду("000000035"); // Получено после дробления CKS 1000 (Парус)
	
	// показатели оперсводки
	
	ПотреблениеВсего = Справочники.алк_ПоказателиПроизводства.НайтиПоКоду("000000059");  //Потребление всего
	ПотреблениеНаКотельнуюОперсводка = Справочники.алк_ПоказателиПроизводства.НайтиПоКоду("000000060");  //Потребление на котельную
	ПотреблениеНаПроизводствоЕль = Справочники.алк_ПоказателиПроизводства.НайтиПоКоду("000000063");  //Потребление  - ель
	ПотреблениеНаПроизводствоЛиственница = Справочники.алк_ПоказателиПроизводства.НайтиПоКоду("000000064");  //Потребление   - лиственница
	ПотреблениеНаПроизводство = Справочники.алк_ПоказателиПроизводства.НайтиПоКоду("000000062");  //Потребление  
	ПотреблениеКора = Справочники.алк_ПоказателиПроизводства.НайтиПоКоду("000000061");  // - в т.ч. кора


	ГранулированиеСреднее = Справочники.алк_ПоказателиПроизводства.НайтиПоКоду("000000074");  //Загрузка производства средняя
	Гранулирование1 = Справочники.алк_ПоказателиПроизводства.НайтиПоКоду("000000075");
	Гранулирование2 = Справочники.алк_ПоказателиПроизводства.НайтиПоКоду("000000076");
	Гранулирование3 = Справочники.алк_ПоказателиПроизводства.НайтиПоКоду("000000077");
	
	Показатели = Новый Массив;
	Показатели.Добавить(Гранулирование1);
	Показатели.Добавить(Гранулирование2);
	Показатели.Добавить(Гранулирование3);
	
	
	ПроизводствоПеллетОперсводка = Справочники.алк_ПоказателиПроизводства.НайтиПоКоду("000000078");
	
	КРСнаПроизводствоПилет = Справочники.алк_ПоказателиПроизводства.НайтиПоКоду("000000079"); //КРС на производство пеллет
	
	КРСобщий = Справочники.алк_ПоказателиПроизводства.НайтиПоКоду("000000080"); 
	
	ОстаткиВСилосеОперсводка = Справочники.алк_ПоказателиПроизводства.НайтиПоКоду("000000065"); 
	
	ПолученоПослеДробилки = Справочники.алк_ПоказателиПроизводства.НайтиПоКоду("000000086"); 
	ПолученоПослеДробленияМРБ110 = Справочники.алк_ПоказателиПроизводства.НайтиПоКоду("000000089"); //Получено после дробления МРБ-110
	ПолученоПослеДробленияМРБ250 = Справочники.алк_ПоказателиПроизводства.НайтиПоКоду("000000087"); //Получено после дробления МРБ-250
	ПолученоПослеДробленияМЛП_2 = Справочники.алк_ПоказателиПроизводства.НайтиПоКоду("000000090"); //Получено после дробления  МЛП№2 (в марте)
	ПолученоПослеДробленияCKS1000 = Справочники.алк_ПоказателиПроизводства.НайтиПоКоду("000000088"); //Получено после дробления CKS 1000 (Парус)

	
	//значения
	
	ПотреблениеНаКотельнуюЗначение 	= 0;
	ПроизводствоПеллетЗначение  	= 0;
	КРСзначение  					= 0; 	
	УпакованоПеллетЗначение 		= 0;
	ГранулированиеВсегоЗначение 	= 0;
	ПроцентКорыЗначение				= 0;
	
	Объект.ПоказателиОперсводки.Очистить();  
	
	ПолученоПослеДробилкиВсего = 0;
	
	Для каждого Стр Из Объект.ОперативныеПоказателиПроизводства Цикл
		
		Если Стр.Показатель = ПотреблениеНаКотельную Тогда			
			НоваяСтр = Объект.ПоказателиОперсводки.Добавить();			
			НоваяСтр.Показатель = ПотреблениеНаКотельнуюОперсводка;
			НоваяСтр.Значение = Стр.Значение * 0.25; 
			
			ПотреблениеНаКотельнуюЗначение = НоваяСтр.Значение;
		КонецЕсли; 
		
		Если Стр.Показатель = ПроизводствоПеллет Тогда 			
			
			НоваяСтр = Объект.ПоказателиОперсводки.Добавить();			
			НоваяСтр.Показатель = ПроизводствоПеллетОперсводка;
			НоваяСтр.Значение = Стр.Значение;
			
			ПроизводствоПеллетЗначение = Стр.Значение;						
		КонецЕсли;
		
		Если Стр.Показатель = Пресс1 Тогда 			
			НоваяСтр = Объект.ПоказателиОперсводки.Добавить();			
			НоваяСтр.Показатель = Гранулирование1;
			НоваяСтр.Значение = Стр.Значение;
			
			ГранулированиеВсегоЗначение = ГранулированиеВсегоЗначение + Стр.Значение;			
		КонецЕсли; 
		
		Если Стр.Показатель = Пресс2 Тогда 			
			НоваяСтр = Объект.ПоказателиОперсводки.Добавить();			
			НоваяСтр.Показатель = Гранулирование2;
			НоваяСтр.Значение = Стр.Значение;	
			
			ГранулированиеВсегоЗначение = ГранулированиеВсегоЗначение + Стр.Значение;
		КонецЕсли;
		
		Если Стр.Показатель = Пресс3 Тогда 			
			НоваяСтр = Объект.ПоказателиОперсводки.Добавить();			
			НоваяСтр.Показатель = Гранулирование3;
			НоваяСтр.Значение = Стр.Значение;
			
			ГранулированиеВсегоЗначение = ГранулированиеВсегоЗначение + Стр.Значение;
		КонецЕсли; 
		
		Если Стр.Показатель = УпакованоПеллет Тогда 			
			УпакованоПеллетЗначение = Стр.Значение;			
		КонецЕсли;		 
		
		Если Стр.Показатель = ПроцентКоры Тогда 			
			ПроцентКорыЗначение = Стр.Значение;			
		КонецЕсли;
		
		Если Стр.Показатель = КРС Тогда 			
			НоваяСтр = Объект.ПоказателиОперсводки.Добавить();			
			НоваяСтр.Показатель = КРСнаПроизводствоПилет;
			НоваяСтр.Значение = Стр.Значение;	
			
			КРСзначение = Стр.Значение;
		КонецЕсли; 
		
				
		Если Стр.Показатель = ПолученоПослеДробленияМРБ110_ДГ Тогда 			
			НоваяСтр = Объект.ПоказателиОперсводки.Добавить();			
			НоваяСтр.Показатель = ПолученоПослеДробленияМРБ110;
			НоваяСтр.Значение = Стр.Значение;	
			
			ПолученоПослеДробилкиВсего = ПолученоПослеДробилкиВсего +  Стр.Значение;
			
		КонецЕсли;
		
		Если Стр.Показатель = ПолученоПослеДробленияМРБ250_ДГ Тогда 			
			НоваяСтр = Объект.ПоказателиОперсводки.Добавить();			
			НоваяСтр.Показатель = ПолученоПослеДробленияМРБ250;
			НоваяСтр.Значение = Стр.Значение;	
			
			ПолученоПослеДробилкиВсего = ПолученоПослеДробилкиВсего +  Стр.Значение;
							
		КонецЕсли;
		
		Если Стр.Показатель = ПолученоПослеДробленияМЛП_2_ДГ Тогда 			
			НоваяСтр = Объект.ПоказателиОперсводки.Добавить();			
			НоваяСтр.Показатель = ПолученоПослеДробленияМЛП_2;
			НоваяСтр.Значение = Стр.Значение;	
			
			ПолученоПослеДробилкиВсего = ПолученоПослеДробилкиВсего +  Стр.Значение;
							
		КонецЕсли;
		
		Если Стр.Показатель = ПолученоПослеДробленияCKS1000_ДГ Тогда 			
			НоваяСтр = Объект.ПоказателиОперсводки.Добавить();			
			НоваяСтр.Показатель = ПолученоПослеДробленияCKS1000;
			НоваяСтр.Значение = Стр.Значение;	
			
			ПолученоПослеДробилкиВсего = ПолученоПослеДробилкиВсего +  Стр.Значение;
							
		КонецЕсли;
				
		Если Стр.Показатель = ОстаткиВСилосе Тогда 			
			НоваяСтр = Объект.ПоказателиОперсводки.Добавить();			
			НоваяСтр.Показатель = ОстаткиВСилосеОперсводка;
			НоваяСтр.Значение = Стр.Значение * 25 * 0.7;	// остаток в силосе на конец = 14%*2500*0,7=245 тонн				
		КонецЕсли; 		
	
	КонецЦикла;
	
	НоваяСтр = Объект.ПоказателиОперсводки.Добавить();			
	НоваяСтр.Показатель = ПолученоПослеДробилки;
	НоваяСтр.Значение = ПолученоПослеДробилкиВсего;	
	
	
	ГранулированиеПланЗначение = ПролучитьПланГранулирование(Объект.ДатаСмены, Объект.Смена, Показатели);
	
	//получает NULL на копии, так как в регистре не плана
	Если ГранулированиеПланЗначение = NULL Тогда 
		ГранулированиеПланЗначение = 0;
	КонецЕсли;  
	//\\

	ВозратВПереработку = ПолучитьОбъемВозвратаВПереработку(Объект.ДатаСмены, Объект.Смена, Объект.Направление);
	
	НоваяСтр = Объект.ПоказателиОперсводки.Добавить();			
	НоваяСтр.Показатель = КРСобщий;
	НоваяСтр.Значение = ПолучитьКРСобщий();  
		
	Если УпакованоПеллетЗначение > 0 Тогда	
		
		ПотреблениеНаПроизводствоОбъем = УпакованоПеллетЗначение * КРСзначение - ВозратВПереработку;
			
		// Нач мод [Пакушев И.С.] [20.04.2022] 
		// Обращение № [0000154994] [В связи в изменившимся соотношением сырья ( с 50/50 на 70/30)  на производство пеллет, 
		// прошу внести изменения в формулу  Оперсводки ДГ в строчке Потребление на производство пеллет 
		// ель 70%, лиственница 30%. ]
		// Было
		// ... = ПотреблениеНаПроизводствоОбъем / 2;
		// Стало		
		ДоляЕль = 0.7;
		ДоляЛиственница = 0.3; 		
		// Кон мод [Пакушев И.С.] [20.04.2022]
		
		НоваяСтр = Объект.ПоказателиОперсводки.Добавить();			
		НоваяСтр.Показатель = ПотреблениеНаПроизводство;
		НоваяСтр.Значение = ПотреблениеНаПроизводствоОбъем; 
		
		НоваяСтр = Объект.ПоказателиОперсводки.Добавить();			
		НоваяСтр.Показатель = ПотреблениеНаПроизводствоЕль;
		НоваяСтр.Значение = ПотреблениеНаПроизводствоОбъем * ДоляЕль;
		
		
		НоваяСтр = Объект.ПоказателиОперсводки.Добавить();			
		НоваяСтр.Показатель = ПотреблениеНаПроизводствоЛиственница;
		НоваяСтр.Значение = ПотреблениеНаПроизводствоОбъем * ДоляЛиственница;
		
	КонецЕсли;	
	
	НоваяСтр = Объект.ПоказателиОперсводки.Добавить();			
	НоваяСтр.Показатель = ПотреблениеВсего;
	НоваяСтр.Значение = УпакованоПеллетЗначение * КРСзначение + ПотреблениеНаКотельнуюЗначение;
	
	НоваяСтр = Объект.ПоказателиОперсводки.Добавить();			
	НоваяСтр.Показатель = ПотреблениеКора;
	НоваяСтр.Значение = (УпакованоПеллетЗначение * КРСзначение + ПотреблениеНаКотельнуюЗначение) * ПроцентКорыЗначение / 100; 	
	
	НоваяСтр = Объект.ПоказателиОперсводки.Добавить();			
	НоваяСтр.Показатель = ГранулированиеСреднее;
	НоваяСтр.Значение = ?(ГранулированиеПланЗначение = 0, 0, 100*ГранулированиеВсегоЗначение/ГранулированиеПланЗначение);	
	   	 	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьОбъемВозвратаВПереработку(ДатаСмены, Смена, Направление)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_РасформированиеПакетовЗапасы.СерийныйНомер
		|ПОМЕСТИТЬ ВТ_Пакеты
		|ИЗ
		|	Документ.алк_РасформированиеПакетов.Запасы КАК алк_РасформированиеПакетовЗапасы
		|ГДЕ
		|	алк_РасформированиеПакетовЗапасы.Ссылка.ДатаСмены = &ДатаСмены
		|	И алк_РасформированиеПакетовЗапасы.Ссылка.Смена = &Смена
		|	И алк_РасформированиеПакетовЗапасы.Ссылка.Проведен
		|	И алк_РасформированиеПакетовЗапасы.Ссылка.Направление = &Направление
		|	И алк_РасформированиеПакетовЗапасы.Ссылка.переупаковка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ЕСТЬNULL(алк_ПараметрыПакетовСрезПоследних.ВесНеттоТаможня, 0)) КАК Вес,
		|	алк_ПараметрыПакетовСрезПоследних.Характеристика.Владелец,
		|	СУММА(алк_ПараметрыПакетовСрезПоследних.Объем) КАК Объем
		|ИЗ
		|	РегистрСведений.алк_ПараметрыПакетов.СрезПоследних(
		|			&ДатаСмены,
		|			СерийныйНомер В
		|				(ВЫБРАТЬ
		|					ВТ_Пакеты.СерийныйНомер
		|				ИЗ
		|					ВТ_Пакеты КАК ВТ_Пакеты)) КАК алк_ПараметрыПакетовСрезПоследних
		|
		|СГРУППИРОВАТЬ ПО
		|	алк_ПараметрыПакетовСрезПоследних.Характеристика.Владелец";
	
	Запрос.УстановитьПараметр("ДатаСмены", ДатаСмены);
	Запрос.УстановитьПараметр("Смена", Смена);  
	Запрос.УстановитьПараметр("Направление", Направление);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Объем = 0;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Объем = ВыборкаДетальныеЗаписи.Объем;		
	КонецЦикла;
	
	Возврат Объем;

КонецФункции // ПролучитьПланГранулирование()
 
&НаСервереБезКонтекста
Функция ПролучитьПланГранулирование(ДатаСмены, Смена, Показатели)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(ЕСТЬNULL(алк_ПлановыеПоказателиСрезПоследних.Значение, 0)) КАК Значение
		|ИЗ
		|	РегистрСведений.алк_ПлановыеПоказатели.СрезПоследних(
		|			,
		|			Период = &Период
		|				И Смена = &Смена
		|				И ПроизводственныйПоказатель В (&Показатели)) КАК алк_ПлановыеПоказателиСрезПоследних";
	
	Запрос.УстановитьПараметр("Период", ДатаСмены);
	Запрос.УстановитьПараметр("Смена", Смена);  
	Запрос.УстановитьПараметр("Показатели", Показатели);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	СуммаПоказателей = 0;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СуммаПоказателей = ВыборкаДетальныеЗаписи.Значение;		
	КонецЦикла;
	
	Возврат СуммаПоказателей;

КонецФункции // ПролучитьПланГранулирование()


&НаКлиенте
Процедура ДиалогСВопросом()
 
    Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект);	
 
    ПоказатьВопрос(Оповещение,
        "Перед заполнением документ будет сохранен. Продолжить?",
        РежимДиалогаВопрос.ДаНет,
        0, // таймаут в секундах
        КодВозвратаДиалога.Да, // (необ.) кнопка по умолчанию
        //"" // (необ.) заголовок
    );    
 
КонецПроцедуры
 
&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
 
	Если Результат = КодВозвратаДиалога.Да Тогда 		
		ЭтотОбъект.Записать();
		ЗаполнитьПоказателиОперсводкиНаСервере();
    КонецЕсли;	
 
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоказателиОперсводки(Команда)
	
	МассивПустыхПоказателей = Объект.ОперативныеПоказателиПроизводства.НайтиСтроки(Новый Структура("Показатель",ПредопределенноеЗначение("Справочник.алк_ПоказателиПроизводстваДГ.ПустаяСсылка"))); 
	
	Если НЕ ЗначениеЗаполнено(Объект.ДатаСмены) ИЛИ НЕ ЗначениеЗаполнено(Объект.Смена) ИЛИ НЕ ЗначениеЗаполнено(Объект.Участок) ИЛИ НЕ ЗначениеЗаполнено(Объект.Направление) ИЛИ Объект.ОперативныеПоказателиПроизводства.Количество() = 0 ИЛИ МассивПустыхПоказателей.Количество() <> 0 Тогда 
		
		Если НЕ ЗначениеЗаполнено(Объект.Участок) Тогда 
			Сообщить("Заполните участок!");
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Объект.ДатаСмены) Тогда 
			Сообщить("Заполните дату смены!");
		КонецЕсли; 
		
		Если НЕ ЗначениеЗаполнено(Объект.Смена) Тогда 
			Сообщить("Заполните смену!");
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Объект.Направление) Тогда 
			Сообщить("Заполните направление!");
		КонецЕсли; 
		
		Если Объект.ОперативныеПоказателиПроизводства.Количество() = 0 Тогда
			Сообщить("Табличная часть пуста! Добавьте показатели!");
		КонецЕсли;  
		
		Если МассивПустыхПоказателей.Количество() <> 0 Тогда
			Сообщить("В табличной части есть не заполненные показатели! Удалите строки с пустыми показателями или заполните их!");
		КонецЕсли;   
		
		Возврат;
		
	КонецЕсли;
	
	Если Модифицированность = Истина Или Объект.Ссылка = Неопределено Тогда
		ДиалогСВопросом();	
	Иначе
		ЗаполнитьПоказателиОперсводкиНаСервере();
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция ПолучитьКРСобщий()
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	0 КАК Ключ
		|ПОМЕСТИТЬ Порядки
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	1
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	2
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	3
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	4
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	5
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	6
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	7
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	8
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	9
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&Дата1, ДЕНЬ), ДЕНЬ, П1.Ключ + П2.Ключ * 10 + П3.Ключ * 100) КАК Дата
		|ПОМЕСТИТЬ СписокДней
		|ИЗ
		|	Порядки КАК П1
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Порядки КАК П2
		|		ПО (ИСТИНА)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Порядки КАК П3
		|		ПО (ИСТИНА)
		|ГДЕ
		|	П1.Ключ + П2.Ключ * 10 + П3.Ключ * 100 <= РАЗНОСТЬДАТ(&Дата1, &Дата2, ДЕНЬ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(алк_ВводПроизводственныхПоказателейДГОперативныеПоказателиПроизводства.Ссылка.ДатаСмены, ДЕНЬ) КАК Дата,
		|	алк_ВводПроизводственныхПоказателейДГОперативныеПоказателиПроизводства.Показатель КАК ЗагрузкаББтонн,
		|	СУММА(алк_ВводПроизводственныхПоказателейДГОперативныеПоказателиПроизводства.Значение) КАК Значение
		|ПОМЕСТИТЬ ЗагрузкаББ
		|ИЗ
		|	Документ.алк_ВводПроизводственныхПоказателейДГ.ОперативныеПоказателиПроизводства КАК алк_ВводПроизводственныхПоказателейДГОперативныеПоказателиПроизводства
		|ГДЕ
		|	алк_ВводПроизводственныхПоказателейДГОперативныеПоказателиПроизводства.Ссылка.ДатаСмены МЕЖДУ &Дата1 И &Дата2
		|	И (алк_ВводПроизводственныхПоказателейДГОперативныеПоказателиПроизводства.Ссылка.Проведен
		|			ИЛИ алк_ВводПроизводственныхПоказателейДГОперативныеПоказателиПроизводства.Ссылка = &Ссылка)
		|	И алк_ВводПроизводственныхПоказателейДГОперативныеПоказателиПроизводства.Показатель.Код = ""000000024""
		|
		|СГРУППИРОВАТЬ ПО
		|	алк_ВводПроизводственныхПоказателейДГОперативныеПоказателиПроизводства.Показатель,
		|	НАЧАЛОПЕРИОДА(алк_ВводПроизводственныхПоказателейДГОперативныеПоказателиПроизводства.Ссылка.ДатаСмены, ДЕНЬ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(алк_ВводПроизводственныхПоказателейДГОперативныеПоказателиПроизводства.Ссылка.ДатаСмены, ДЕНЬ) КАК Дата,
		|	алк_ВводПроизводственныхПоказателейДГОперативныеПоказателиПроизводства.Показатель КАК ЗагрузкаББтонн,
		|	СУММА(алк_ВводПроизводственныхПоказателейДГОперативныеПоказателиПроизводства.Значение * 0.25) КАК Значение
		|ПОМЕСТИТЬ РасходНаКотельную
		|ИЗ
		|	Документ.алк_ВводПроизводственныхПоказателейДГ.ОперативныеПоказателиПроизводства КАК алк_ВводПроизводственныхПоказателейДГОперативныеПоказателиПроизводства
		|ГДЕ
		|	алк_ВводПроизводственныхПоказателейДГОперативныеПоказателиПроизводства.Ссылка.ДатаСмены МЕЖДУ &Дата1 И &Дата2
		|	И (алк_ВводПроизводственныхПоказателейДГОперативныеПоказателиПроизводства.Ссылка.Проведен
		|			ИЛИ алк_ВводПроизводственныхПоказателейДГОперативныеПоказателиПроизводства.Ссылка = &Ссылка)
		|	И алк_ВводПроизводственныхПоказателейДГОперативныеПоказателиПроизводства.Показатель.Код = ""000000026""
		|
		|СГРУППИРОВАТЬ ПО
		|	алк_ВводПроизводственныхПоказателейДГОперативныеПоказателиПроизводства.Показатель,
		|	НАЧАЛОПЕРИОДА(алк_ВводПроизводственныхПоказателейДГОперативныеПоказателиПроизводства.Ссылка.ДатаСмены, ДЕНЬ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СписокДней.Дата,
		|	СУММА(ЗагрузкаББ.Значение) КАК Значение
		|ПОМЕСТИТЬ ЗагрузкаНарастающим
		|ИЗ
		|	СписокДней КАК СписокДней
		|		ЛЕВОЕ СОЕДИНЕНИЕ ЗагрузкаББ КАК ЗагрузкаББ
		|		ПО СписокДней.Дата >= ЗагрузкаББ.Дата
		|
		|СГРУППИРОВАТЬ ПО
		|	СписокДней.Дата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СписокДней.Дата,
		|	СУММА(РасходНаКотельную.Значение) КАК Значение
		|ПОМЕСТИТЬ РасходНарастающим
		|ИЗ
		|	СписокДней КАК СписокДней
		|		ЛЕВОЕ СОЕДИНЕНИЕ РасходНаКотельную КАК РасходНаКотельную
		|		ПО СписокДней.Дата >= РасходНаКотельную.Дата
		|
		|СГРУППИРОВАТЬ ПО
		|	СписокДней.Дата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СписокДней.Дата КАК Период,
		|	""КРСОбщийПелетты"" КАК Показатель,
		|	ВЫРАЗИТЬ(1.88 + ВЫБОР
		|			КОГДА ЗагрузкаНарастающим.Значение = 0
		|				ТОГДА 0
		|			ИНАЧЕ РасходНарастающим.Значение / ЗагрузкаНарастающим.Значение
		|		КОНЕЦ КАК ЧИСЛО(15, 3)) КАК Количество,
		|	ИСТИНА КАК ЭтоФакт
		|ПОМЕСТИТЬ Итог
		|ИЗ
		|	СписокДней КАК СписокДней
		|		ЛЕВОЕ СОЕДИНЕНИЕ ЗагрузкаНарастающим КАК ЗагрузкаНарастающим
		|		ПО СписокДней.Дата = ЗагрузкаНарастающим.Дата
		|		ЛЕВОЕ СОЕДИНЕНИЕ РасходНарастающим КАК РасходНарастающим
		|		ПО СписокДней.Дата = РасходНарастающим.Дата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Итог.Период,
		|	Итог.Количество
		|ИЗ
		|	Итог КАК Итог
		|ГДЕ
		|	Итог.Период = &Период";
	
	Запрос.УстановитьПараметр("Дата1", НачалоМесяца(Объект.Дата));
	Запрос.УстановитьПараметр("Дата2", КонецМесяца(Объект.Дата));
	Запрос.УстановитьПараметр("Период", НачалоДня(Объект.Дата));
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	КРСобщий = 0;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		КРСобщий = ВыборкаДетальныеЗаписи.Количество;
	КонецЦикла;
	
	Возврат КРСобщий;

КонецФункции // ПолучитьКРСобщий()


&НаСервере
Процедура УчастокПриИзмененииНаСервере()
	Элементы.Смена.ПараметрыВыбора = РфпСервер.ПолучитьОтборПоТипуСмены(Объект.Участок, Объект.ДатаСмены);
КонецПроцедуры

&НаКлиенте
Процедура УчастокПриИзменении(Элемент)
	УчастокПриИзмененииНаСервере();
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УчастокПриИзмененииНаСервере();
КонецПроцедуры
